#include <stdio.h>
#include <iostream>
#include <fstream>
#include <vector>
#include <string>
#include <conio.h>  // _kbhit()を使うため．Windows向け

/*----------------------------------------------------------------------*/
//Todo 課題3 "crlserial2025.hpp"というヘッダファイルをインクルードして使ってください．

/*----------------------------------------------------------------------*/

#define PORT TEXT("COM8")   // ポートを設定 各自の環境によって変わります．適切なものを設定してください．
#define BAUD 115200         // ボーレートを設定
#define DATA_NUM 8          // データを読み込む個数（カンマ区切りの列数）を設定

int main() {
    /*----------------------------------------------------------------------*/
    //Todo 課題3 コントローラーの入力をシリアルポートから受け取り，それをcsvに書き込んでください．


    return 0;
    /*----------------------------------------------------------------------*/
}
